
(function() {

    angular.module('staticContent', [])
        .constant(
            'menuLabels', {
                HOME: 'Αρχική',
                SERVICES: 'Υπηρεσίες',
                GALLERY: 'Δείγματα',
                OFFERS: 'Προσφορές',
                INFORMATION: 'Πληροφορίες',
                CONTACT: 'Επικοινωνία'
            }
        )
        .constant(
            'bottomBanner', {
                VIEW_OFFERS: 'Δείτε όλες τις προσφορές μας ',
                VIEW_OFFERS_LINK: 'εδώ',
                ADDRESS_INFO: 'Μελίσσι,Γιαννιτσά Τ.Κ. 58100,τηλ:23820-42455.',
                SEND_EMAIL: 'Άμεσες-online εκτιμήσεις. Στείλτε μας email με ένα κλικ.',
                REFUNDS: 'Aναλαμβάνουμε αποζημιώσεις από ασφαλιστικές εταιρίες.',
                MAP_HEADER: 'Που θα μας βρείτε:'
            }
        )
        .constant(
            'informationText', {
                INFO_HEADER: 'Ποιοί είμαστε...',
                INFO_MAIN: 'Η επιχείρηση μας δραστηριοποιείται στον χώρο τής επισκευής του αυτοκινήτου για 30 σχεδόν χρόνια. \
                            Συνεπώς, η εμπειρία μας στον χώρο αυτό είναι μεγάλη και εμπνέει εμπιστοσύνη και σιγουριά στους πελάτες μας. \
                            Δουλεύουμε σταθερά και μεθοδικά με στόχο το καλύτερο δυνατό αποτέλεσμα και σκεπτόμενοι πάντοτε το συμφέρον σας. \
                            Γι αυτό προσφέρουμε μια σειρά από υπηρεσίες που θα κάνουν την ζωή σας ευκολότερη.',
                INFO_GET_CAR: '-Αν χρειαστεί, παραλαμβάνουμε από τον χώρο σας και επιστρέφουμε το προς επισκευή όχημά σας χωρίς εσείς να επιβαρυνθείτε με καμία μεταφορά.',
                INFO_OFFERS: '-Έχουμε μια σειρά από άκρως ενδιαφέρουσες προσφορές σκεπτόμενοι την τσέπη σας.',
                INFO_EMAIL: '-Σας δίνουμε την δυνατότητα να επικοινωνήσετε μαζί μας μέσω email για μια πιο ακριβή εκτίμηση της ζημίας του αυτοκινήτου.'
            }
        )

})();