(function() {

    angular.module('staticContent', [])
        .constant(
            'menuLabels', {
                HOME: 'Αρχική',
                SERVICES: 'Υπηρεσίες',
                GALLERY: 'Δείγματα',
                OFFERS: 'Προσφορές',
                INFORMATION: 'Πληροφορίες',
                CONTACT: 'Επικοινωνία'
            }
        )
        .constant(
            'bottomBanner', {
                VIEW_OFFERS: 'Δείτε όλες τις προσφορές μας ',
                VIEW_OFFERS_LINK: 'εδώ',
                ADDRESS_INFO: 'Μελίσσι,Γιαννιτσά Τ.Κ. 58100,τηλ:23820-42455.',
                SEND_EMAIL: 'Άμεσες-online εκτιμήσεις. Στείλτε μας email με ένα κλικ.',
                REFUNDS: 'Aναλαμβάνουμε αποζημιώσεις από ασφαλιστικές εταιρίες.',
                MAP_HEADER: 'Που θα μας βρείτε:'
            }
        )
        .constant(
            'informationText', {
                INFO_HEADER: 'Ποιοί είμαστε...',
                INFO_MAIN: 'Η επιχείρηση μας δραστηριοποιείται στον χώρο τής επισκευής του αυτοκινήτου για 30 σχεδόν χρόνια. \
                            Συνεπώς, η εμπειρία μας στον χώρο αυτό είναι μεγάλη και εμπνέει εμπιστοσύνη και σιγουριά στους πελάτες μας. \
                            Δουλεύουμε σταθερά και μεθοδικά με στόχο το καλύτερο δυνατό αποτέλεσμα και σκεπτόμενοι πάντοτε το συμφέρον σας. \
                            Γι αυτό προσφέρουμε μια σειρά από υπηρεσίες που θα κάνουν την ζωή σας ευκολότερη.',
                INFO_GET_CAR: '-Αν χρειαστεί, παραλαμβάνουμε από τον χώρο σας και επιστρέφουμε το προς επισκευή όχημά σας χωρίς εσείς να επιβαρυνθείτε με καμία μεταφορά.',
                INFO_OFFERS: '-Έχουμε μια σειρά από άκρως ενδιαφέρουσες προσφορές σκεπτόμενοι την τσέπη σας.',
                INFO_EMAIL: '-Σας δίνουμε την δυνατότητα να επικοινωνήσετε μαζί μας μέσω email για μια πιο ακριβή εκτίμηση της ζημίας του αυτοκινήτου.'
            }
        )
        .constant(
            'servicesText', {
                SERVICES_PAINT_HEADER: 'ΟΛΙΚΕΣ-ΤΟΠΙΚΕΣ ΒΑΦΕΣ',
                SERVICES_PAINT_TEXT_BODY: 'Χρησιμοποιώντας τα καλύτερα υλικά της αγοράς και τα κατάλληλα αντιχαρακτικά βερνίκια με την 30ετη μας πείρα, να είστε σίγουροι οτι θα έχετε το καταλληλο αποτέλεσμα στην βαφή ή στην επισκευή του οχήματός σας. Ανάλογα με την περίπτωση σας θα σας προτείνουμε ολική η τοπική βαφή. Δεν είναι πλέον απαραίτητο για μια μικρή εκδορά (πχ γωνία προφυλακτήρα) να βάφουμε ολόκληρο το κομμάτι, εξοικονομώντας σας έτσι χρήματα και χρόνο. Όταν χρειαστεί ολική βαφή, τα κομμάτια αφαιρούνται ώστε να βαφούν όλα τα κρυφά και δύσκολα σημεία.',
                SERVICES_POLISHING_HEADER: 'ΓΥΑΛΙΣΜΑ',
                SERVICES_POLISHING_TEXT_BODY: 'Ένα σωστό και επαγγελματικό γυάλισμα αυτοκινήτου απαιτεί χρόνο αλλά και τις απαραίτητες γνώσεις για να έχετε το επιθυμητό αποτέλεσμα, αλλά και διάρκεια στο χρόνο.Με την πολυετή πείρα που διαθέτουμε επαναφέρουμε τη χαμένη λάμψη με ειδικές αλοιφές και προστατέυουμε το χρώμα με το καταλληλο κερι. Επιπρόσθετα, μπορουμε να αφαιρεσουμε τις επιφανειακες γρατζουνιες η το ξενο χρωμα πχ. απο ελαφρυ χτυπημα η νυχια σκυλου με ειδικες αλοιφες γλυτωνοντας την βαφη.',
                SERVICES_LIGHTS_HEADER: 'ΞΕΘΑΜΠΩΜΑ',
                SERVICES_LIGHTS_TEXT_BODY: 'Ξεθαμπωνουμε τα μπροστινά φαναρια του αυτοκινήτου σας, που επαναφερει τη σωστή ορατότητα στην οδήγηση, προσφέροντας άνεση και ασφάλεια.',
                SERVICES_RIMS_HEADER: 'ΒΑΦΕΣ ΖΑΝΤΩΝ',
                SERVICES_RIMS_TEXT_BODY: 'Η βαφή των ζαντων κρίνεται απαραίτητη είτε για αισθητικους λόγους ειτε για την κατάλληλη συντήρηση στο πέρασμα του χρόνου.  Για όσους επιθυμούν κατι ξεχωριστό  υπάρχει και η ματ βαφή σε ολες τις αποχρώσεις.'
            }
        )
})();